#### Terraform Plan
```
module.edge.cloudflare_d1_database.global_db: Refreshing state... [id=71f876c0-dc58-4664-9fee-b34f4091709e]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/compute.googleapis.com]
google_project_service.apis["aiplatform.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/aiplatform.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/artifactregistry.googleapis.com]
google_project_service.apis["eventarc.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/eventarc.googleapis.com]
google_project_service.apis["earthengine.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/earthengine.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/run.googleapis.com]
google_project_service.apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/cloudscheduler.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/pubsub.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/cloudresourcemanager.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/bigquery.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/iam.googleapis.com]
google_project_service.apis["storage.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/storage.googleapis.com]
module.edge.cloudflare_worker_script.api_gateway: Refreshing state... [id=wx-api-gateway]
module.edge.cloudflare_pages_project.wx_frontend: Refreshing state... [id=hyperlocal-wx-app]
module.edge.cloudflare_record.city_dns["denver"]: Refreshing state... [id=afde87271f37ac2c5379fc8f6f5d4d56]
module.edge.cloudflare_record.city_dns["durango"]: Refreshing state... [id=01cc05e1792f850aff5bb5f82d823e68]
module.edge.cloudflare_record.city_dns["salt-lake-city"]: Refreshing state... [id=7d85ed20117d4445d3b5d1f8aebfa25f]
module.edge.cloudflare_worker_route.api_routes["salt-lake-city"]: Refreshing state... [id=b472f9fa8ce24a87a4418081649174ba]
module.edge.cloudflare_worker_route.api_routes["denver"]: Refreshing state... [id=e11ee3c9e64a4d99afdff1a8b7f47b07]
module.edge.cloudflare_worker_route.api_routes["durango"]: Refreshing state... [id=b1a2f1c25c914a558fd71998ba0c40ea]
module.edge.cloudflare_pages_domain.city_domains["salt-lake-city"]: Refreshing state... [id=b2dff2ca-b334-4a94-accd-49a10c65c276]
module.edge.cloudflare_pages_domain.city_domains["durango"]: Refreshing state... [id=88913d92-1083-45fd-a168-16aa65001a3d]
module.edge.cloudflare_pages_domain.city_domains["denver"]: Refreshing state... [id=3817050e-52d3-4ddc-97a0-40e9dedaef4f]
module.notifications.google_pubsub_topic.commentary_ready: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/commentary-ready]
module.notifications.google_pubsub_topic.drift_alerts: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/model-drift-alerts]
module.ingestion.google_service_account.ingest_sa: Refreshing state... [id=projects/hyperlocal-wx-prod/serviceAccounts/nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.notifications.google_pubsub_topic.subscriber_notifications: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/subscriber-notifications]
module.ml_and_jobs.google_storage_bucket.commentary: Refreshing state... [id=hyperlocal-wx-commentary]
module.ingestion.google_artifact_registry_repository.wx_repo: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/repositories/weather-services]
module.analytics.google_bigquery_dataset.weather_core: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core]
module.ml_and_jobs.google_service_account.ml_sa: Refreshing state... [id=projects/hyperlocal-wx-prod/serviceAccounts/llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_project_iam_member.deploy_ci_run_admin: Refreshing state... [id=hyperlocal-wx-prod/roles/run.admin/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_project_iam_member.deploy_ci_sa_user: Refreshing state... [id=hyperlocal-wx-prod/roles/iam.serviceAccountUser/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_project_iam_member.deploy_ci_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/artifactregistry.writer/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_storage_bucket_iam_member.commentary_public_read: Refreshing state... [id=b/hyperlocal-wx-commentary/roles/storage.objectViewer/allUsers]
module.ingestion.google_project_iam_member.ingest_bq_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataEditor/serviceAccount:nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_storage_bucket_iam_member.commentary_writer: Refreshing state... [id=b/hyperlocal-wx-commentary/roles/storage.objectAdmin/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.vertex_ai_user: Refreshing state... [id=hyperlocal-wx-prod/roles/aiplatform.user/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.bq_reader: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataViewer/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.bq_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataEditor/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.bq_job_user: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.jobUser/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.analytics.google_bigquery_table.model_drift_view: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/model_drift]
module.analytics.google_bigquery_table.ground_truth: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/ground_truth]
module.analytics.google_bigquery_table.grid_points_sampled: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/grid_points_sampled]
module.analytics.google_bigquery_table.verification_scores_view: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/verification_scores]
module.analytics.google_bigquery_table.grid_tiles: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/grid_tiles]
module.analytics.google_bigquery_table.terrain_context: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/terrain_context]
module.analytics.google_bigquery_table.grid_tile_fields: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/grid_tile_fields]
module.analytics.google_bigquery_table.forecast_runs: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/forecast_runs]
module.ingestion.google_cloud_run_v2_service.grib_parser: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser]
module.ml_and_jobs.google_cloud_run_v2_service.llm_commentary: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary]
module.ingestion.google_cloud_run_v2_service_iam_member.pubsub_invoker: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser/roles/run.invoker/serviceAccount:nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_cloud_scheduler_job.nam_ingest_schedule: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/nam-ingest-trigger]
module.ingestion.google_cloud_scheduler_job.gfs_ingest_schedule: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gfs-ingest-trigger]
module.ml_and_jobs.google_cloud_run_v2_service_iam_member.commentary_public: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary/roles/run.invoker/allUsers]
module.ml_and_jobs.google_cloud_scheduler_job.commentary_generation: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/commentary-generation-trigger]
module.ml_and_jobs.google_cloud_scheduler_job.gee_terrain_refresh: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gee-annual-terrain-refresh]
module.ml_and_jobs.google_cloud_scheduler_job.gee_verification: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gee-daily-rtma-verification]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.analytics.google_bigquery_table.forecast_runs will be updated in-place
  ~ resource "google_bigquery_table" "forecast_runs" {
        id                              = "projects/hyperlocal-wx-prod/datasets/weather_core/tables/forecast_runs"
      ~ schema                          = jsonencode(
          ~ [
                # (12 unchanged elements hidden)
                {
                    mode = "NULLABLE"
                    name = "relative_humidity"
                    type = "FLOAT"
                },
              + {
                  + description = "Deterministic idempotency key for ingest dedupe"
                  + mode        = "NULLABLE"
                  + name        = "record_key"
                  + type        = "STRING"
                },
              + {
                  + description = "Ingest run identifier"
                  + mode        = "NULLABLE"
                  + name        = "ingest_id"
                  + type        = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "ingested_at"
                  + type = "TIMESTAMP"
                },
            ]
        )
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.analytics.google_bigquery_table.ingest_dlq will be created
  + resource "google_bigquery_table" "ingest_dlq" {
      + allow_resource_tags_on_deletion = false
      + clustering                      = [
          + "table_name",
          + "ingest_id",
        ]
      + creation_time                   = (known after apply)
      + dataset_id                      = "weather_core"
      + deletion_protection             = true
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "hyperlocal-wx-prod"
      + schema                          = jsonencode(
            [
              + {
                  + mode = "REQUIRED"
                  + name = "ingest_id"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "table_name"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "record_key"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "payload_json"
                  + type = "JSON"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "errors_json"
                  + type = "JSON"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "attempt_count"
                  + type = "INTEGER"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "failed_at"
                  + type = "TIMESTAMP"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "ingest_dlq"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "failed_at"
          + type          = "DAY"
        }
    }

  # module.edge.cloudflare_pages_project.wx_frontend will be updated in-place
  ~ resource "cloudflare_pages_project" "wx_frontend" {
        id                = "hyperlocal-wx-app"
        name              = "hyperlocal-wx-app"
        # (5 unchanged attributes hidden)

      ~ build_config {
          ~ destination_dir = ".svelte-kit/cloudflare" -> "dist"
            # (2 unchanged attributes hidden)
        }

      ~ deployment_configs {
          ~ production {
              ~ environment_variables                = {
                  - "COMMENTARY_API_URL"  = "https://gemini-forecast-commentary-xxxxxxxxxx-uc.a.run.app" -> null
                  - "GCS_COMMENTARY_BASE" = "https://storage.googleapis.com/hyperlocal-wx-commentary" -> null
                }
                # (10 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.edge.cloudflare_worker_script.api_gateway will be updated in-place
  ~ resource "cloudflare_worker_script" "api_gateway" {
      ~ content             = <<-EOT
            // Hyperlocal Weather API Gateway Worker
          - // Handles paywall validation, crowdsourced report submission, and forecast caching
          + // Handles paywall validation, crowdsourced report submission, and edge-cached forecast delivery
            
          + const DEFAULT_COMMENTARY_BASE = "https://storage.googleapis.com/hyperlocal-wx-commentary";
          + const DEFAULT_TTL_SECONDS = 300;
          + const MAX_TTL_SECONDS = 900;
          + 
          + function json(data, init = {}) {
          +   return new Response(JSON.stringify(data), {
          +     ...init,
          +     headers: {
          +       "content-type": "application/json; charset=utf-8",
          +       ...(init.headers || {}),
          +     },
          +   });
          + }
          + 
          + async function ensureCacheVersionTable(db) {
          +   await db
          +     .prepare(
          +       `CREATE TABLE IF NOT EXISTS forecast_cache_versions (
          +         city_slug TEXT PRIMARY KEY,
          +         version INTEGER NOT NULL DEFAULT 1,
          +         updated_at TEXT NOT NULL DEFAULT (datetime('now'))
          +       )`,
          +     )
          +     .run();
          + }
          + 
          + async function getCacheVersion(db, city) {
          +   await ensureCacheVersionTable(db);
          +   const [cityRow, globalRow] = await Promise.all([
          +     db
          +       .prepare("SELECT version FROM forecast_cache_versions WHERE city_slug = ?")
          +       .bind(city)
          +       .first(),
          +     db
          +       .prepare("SELECT version FROM forecast_cache_versions WHERE city_slug = ?")
          +       .bind("all")
          +       .first(),
          +   ]);
          + 
          +   return `${globalRow?.version ?? 1}.${cityRow?.version ?? 1}`;
          + }
          + 
          + async function bumpCacheVersion(db, city) {
          +   await ensureCacheVersionTable(db);
          +   await db
          +     .prepare(
          +       `INSERT INTO forecast_cache_versions (city_slug, version, updated_at)
          +        VALUES (?, 2, datetime('now'))
          +        ON CONFLICT(city_slug)
          +        DO UPDATE SET version = forecast_cache_versions.version + 1, updated_at = datetime('now')`,
          +     )
          +     .bind(city)
          +     .run();
          + }
          + 
          + function buildForecastCacheUrl(requestUrl, city, version) {
          +   // Only city + cache version in the key — upstream always returns the same
          +   // latest.json regardless of model/units/hourWindow, so including those params
          +   // would fragment the cache with duplicate entries.
          +   const cacheUrl = new URL(requestUrl.toString());
          +   cacheUrl.pathname = "/api/forecast";
          +   cacheUrl.search = "";
          +   cacheUrl.searchParams.set("city", city);
          +   cacheUrl.searchParams.set("v", String(version ?? 1));
          +   return cacheUrl;
          + }
          + 
            export default {
              async fetch(request, env, ctx) {
                const url = new URL(request.url);
                const path = url.pathname;
            
                // Health check
                if (path === "/health") {
                  return new Response("OK", { status: 200 });
                }
            
          +     // Forecast proxy + edge cache (Cloudflare Worker as serving layer)
          +     if (path === "/api/forecast" && request.method === "GET") {
          +       const city = url.searchParams.get("city")?.trim().toLowerCase();
          +       if (!city || !/^[a-z0-9-]+$/.test(city)) {
          +         return json(
          +           { error: "Missing or invalid city. Use ?city=<slug>." },
          +           { status: 400 },
          +         );
          +       }
          + 
          +       const cacheVersion = await getCacheVersion(env.DB, city);
          +       const cacheUrl = buildForecastCacheUrl(url, city, cacheVersion);
          +       const cacheKey = new Request(cacheUrl.toString(), { method: "GET" });
          +       const cache = caches.default;
          +       const cached = await cache.match(cacheKey);
          + 
          +       if (cached) {
          +         const headers = new Headers(cached.headers);
          +         headers.set("x-cache", "HIT");
          +         return new Response(cached.body, { status: cached.status, headers });
          +       }
          + 
          +       const ttl = Math.max(
          +         60,
          +         Math.min(Number.parseInt(env.FORECAST_TTL_SECONDS || "", 10) || DEFAULT_TTL_SECONDS, MAX_TTL_SECONDS),
          +       );
          +       const commentaryBase = env.COMMENTARY_BASE_URL || DEFAULT_COMMENTARY_BASE;
          +       const upstreamUrl = `${commentaryBase}/${city}/latest.json`;
          +       const upstream = await fetch(upstreamUrl, {
          +         headers: { Accept: "application/json" },
          +       });
          + 
          +       if (!upstream.ok) {
          +         return json(
          +           { error: "Forecast unavailable", city, status: upstream.status },
          +           { status: upstream.status === 404 ? 404 : 502 },
          +         );
          +       }
          + 
          +       const headers = new Headers(upstream.headers);
          +       headers.set("content-type", "application/json; charset=utf-8");
          +       headers.set("cache-control", `public, s-maxage=${ttl}, stale-while-revalidate=300`);
          +       headers.set("x-cache", "MISS");
          + 
          +       const response = new Response(upstream.body, {
          +         status: upstream.status,
          +         headers,
          +       });
          + 
          +       ctx.waitUntil(cache.put(cacheKey, response.clone()));
          +       return response;
          +     }
          + 
          +     // Cache invalidation endpoint for ingestion pipeline
          +     if (path === "/api/cache/purge" && request.method === "POST") {
          +       const token = request.headers.get("x-cache-purge-token");
          +       if (!env.CACHE_PURGE_TOKEN) {
          +         return json(
          +           { error: "Cache purge token not configured" },
          +           { status: 503 },
          +         );
          +       }
          +       if (!token || token !== env.CACHE_PURGE_TOKEN) {
          +         return json({ error: "Unauthorized" }, { status: 401 });
          +       }
          + 
          +       const body = await request.json().catch(() => ({}));
          +       const city = String(body.city || "all").toLowerCase();
          +       if (!/^[a-z0-9-]+$/.test(city)) {
          +         return json(
          +           { error: "Invalid city slug in purge request" },
          +           { status: 400 },
          +         );
          +       }
          + 
          +       if (city === "all") {
          +         await bumpCacheVersion(env.DB, "all");
          +       } else {
          +         await bumpCacheVersion(env.DB, city);
          +       }
          + 
          +       return json({ ok: true, city, purgedAt: new Date().toISOString() });
          +     }
          + 
                // Crowdsourced weather report submission
                if (path === "/api/report" && request.method === "POST") {
                  const body = await request.json();
                  const { city_slug, temp, precip, snow, notes, lat, lon } = body;
            
                  await env.DB.prepare(
                    `INSERT INTO reports (city_slug, temp, precip, snow, notes, lat, lon, created_at) 
          -          VALUES (?, ?, ?, ?, ?, ?, ?, datetime('now'))`
          -       ).bind(city_slug, temp, precip, snow, notes, lat, lon).run();
          +          VALUES (?, ?, ?, ?, ?, ?, ?, datetime('now'))`,
          +       )
          +         .bind(city_slug, temp, precip, snow, notes, lat, lon)
          +         .run();
            
                  return Response.json({ ok: true });
                }
            
                // Subscriber paywall check
                if (path.startsWith("/api/premium")) {
                  // Validate Stripe JWT from cookie
                  const cookie = request.headers.get("Cookie") || "";
                  const token = cookie.match(/wx_session=([^;]+)/)?.[1];
          -       
          + 
                  if (!token) {
                    return Response.json({ error: "Subscription required" }, { status: 401 });
                  }
            
                  // TODO: Validate JWT signature against Stripe webhook secret
                  return new Response("Premium content", { status: 200 });
                }
            
                return new Response("Not found", { status: 404 });
              },
            };
        EOT
        id                  = "wx-api-gateway"
        name                = "wx-api-gateway"
        tags                = []
        # (3 unchanged attributes hidden)

      + plain_text_binding {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + plain_text_binding {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + plain_text_binding {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (1 unchanged block hidden)
    }

  # module.ingestion.google_cloud_run_v2_service.grib_parser will be updated in-place
  ~ resource "google_cloud_run_v2_service" "grib_parser" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser"
        name                    = "grib2-byte-parser"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "09f86dc6ba77c08bbfda9321c3da5ab059890c70" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/grib2-parser:09f86dc6ba77c08bbfda9321c3da5ab059890c70" -> "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/grib2-parser:latest"
                # (3 unchanged attributes hidden)

              ~ env {
                    name  = "CITIES_CONFIG"
                  ~ value = jsonencode(
                      ~ {
                          ~ denver         = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 9000
                                  + heat_index_f      = 95
                                  + rain_in_1h_in     = 0.5
                                  + snow_in_24h_in    = 6
                                  + wind_gust_mph     = 45
                                }
                              + aliases          = [
                                  + "den",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Front Range weather with elevation-aware detail"
                                }
                              ~ name             = "Denver, CO" -> "Denver"
                              + seasonal_hazards = [
                                  + "snow",
                                  + "hail",
                                  + "high_wind",
                                  + "fire_smoke",
                                ]
                              + state            = "CO"
                              + terrain_profile  = "plains"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                          ~ durango        = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 10000
                                  + heat_index_f      = 92
                                  + rain_in_1h_in     = 0.6
                                  + snow_in_24h_in    = 10
                                  + wind_gust_mph     = 50
                                }
                              + aliases          = [
                                  + "dgo",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Mountain weather for town, trails, and passes"
                                }
                              ~ name             = "Durango, CO" -> "Durango"
                              + seasonal_hazards = [
                                  + "snowpack",
                                  + "monsoon_flooding",
                                  + "fire_smoke",
                                  + "high_wind",
                                ]
                              + state            = "CO"
                              + terrain_profile  = "mountain"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                          ~ salt-lake-city = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 9500
                                  + heat_index_f      = 95
                                  + rain_in_1h_in     = 0.4
                                  + snow_in_24h_in    = 8
                                  + wind_gust_mph     = 50
                                }
                              + aliases          = [
                                  + "slc",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Wasatch-aware forecasts, valley to crest"
                                }
                              ~ name             = "Salt Lake City, UT" -> "Salt Lake City"
                              + seasonal_hazards = [
                                  + "lake_effect_snow",
                                  + "inversions",
                                  + "high_wind",
                                ]
                              + state            = "UT"
                              + terrain_profile  = "foothills"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                        }
                    )
                }
              + env {
                  + name  = "EDGE_CACHE_PURGE_URL"
                  + value = "https://api.denver.hyperlocalwx.com/api/cache/purge"
                }
              + env {
                  + name  = "EDGE_CACHE_PURGE_TOKEN"
                  + value = (sensitive value)
                }

                # (7 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ml_and_jobs.google_cloud_run_v2_service.llm_commentary will be updated in-place
  ~ resource "google_cloud_run_v2_service" "llm_commentary" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary"
        name                    = "gemini-forecast-commentary"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "f4181ffe86d90b8384d9695f22e1edeb2655fcb9" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/llm-commentary:f4181ffe86d90b8384d9695f22e1edeb2655fcb9" -> "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/llm-commentary:latest"
                # (3 unchanged attributes hidden)

              ~ env {
                    name  = "CITIES_CONFIG"
                  ~ value = jsonencode(
                      ~ {
                          ~ denver         = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 9000
                                  + heat_index_f      = 95
                                  + rain_in_1h_in     = 0.5
                                  + snow_in_24h_in    = 6
                                  + wind_gust_mph     = 45
                                }
                              + aliases          = [
                                  + "den",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Front Range weather with elevation-aware detail"
                                }
                              ~ name             = "Denver, CO" -> "Denver"
                              + seasonal_hazards = [
                                  + "snow",
                                  + "hail",
                                  + "high_wind",
                                  + "fire_smoke",
                                ]
                              + state            = "CO"
                              + terrain_profile  = "plains"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                          ~ durango        = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 10000
                                  + heat_index_f      = 92
                                  + rain_in_1h_in     = 0.6
                                  + snow_in_24h_in    = 10
                                  + wind_gust_mph     = 50
                                }
                              + aliases          = [
                                  + "dgo",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Mountain weather for town, trails, and passes"
                                }
                              ~ name             = "Durango, CO" -> "Durango"
                              + seasonal_hazards = [
                                  + "snowpack",
                                  + "monsoon_flooding",
                                  + "fire_smoke",
                                  + "high_wind",
                                ]
                              + state            = "CO"
                              + terrain_profile  = "mountain"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                          ~ salt-lake-city = {
                              + alert_thresholds = {
                                  + freezing_level_ft = 9500
                                  + heat_index_f      = 95
                                  + rain_in_1h_in     = 0.4
                                  + snow_in_24h_in    = 8
                                  + wind_gust_mph     = 50
                                }
                              + aliases          = [
                                  + "slc",
                                ]
                              + branding         = {
                                  + hero_image    = null
                                  + local_tagline = "Wasatch-aware forecasts, valley to crest"
                                }
                              ~ name             = "Salt Lake City, UT" -> "Salt Lake City"
                              + seasonal_hazards = [
                                  + "lake_effect_snow",
                                  + "inversions",
                                  + "high_wind",
                                ]
                              + state            = "UT"
                              + terrain_profile  = "foothills"
                              + timezone         = "America/Denver"
                                # (3 unchanged attributes hidden)
                            }
                        }
                    )
                }

                # (6 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  + d1_database_id = "71f876c0-dc58-4664-9fee-b34f4091709e"

Warning: Argument is deprecated

  with module.edge.cloudflare_record.city_dns["durango"],
  on modules/edge/main.tf line 45, in resource "cloudflare_record" "city_dns":
  45:   value   = "${cloudflare_pages_project.wx_frontend.name}.pages.dev"

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 2 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.edge.cloudflare_worker_script.api_gateway,
  on modules/edge/main.tf line 62, in resource "cloudflare_worker_script" "api_gateway":
  62: resource "cloudflare_worker_script" "api_gateway" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @jpoehnelt*